let count=document.querySelector("#pPage2")
let c=0
function c_sabha()
{
 c++;
 count.innerHTML=c
}
let h=["عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان)","قال: سمعت رسول الله صلى الله عليه وسلم يقول: أفضل الذكر لا إله إلا الله، وأفضل الدعاء الحمد لله","عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم: من صمت نجا","أن رجلاً قال: يا رسول الله إن شرائع الإسلام قد كثرت علي فأخبرني بشيء أتشبث به، قال: لا يزال لسانك رطباً من ذكر الله","أن رجلاً قال للنبي صلى الله عليه وسلم: أوصني، قال: لا تغضب فردد مراراً، قال: لا تغضب","عن أبي هريرة رضى الله عنه أن رسول الله قال: «خيرُ الصدقة ما كان عن ظهر غنى، وابْدأْ بمن تعول»","عن أبي هريرة رضى الله عنه أن رسول الله صلى الله عليه وسلم قال: قال الله تعالى: «أنْفِقْ يا ابن آدم أُنْفِقْ عليك»","عن جابر بن عبد الله رضي الله عنهما قال: سمعت رسول الله يقول: أفضل الذكر لا إله إلا الله، وأفضل الدعاء الحمد لله","عن أبي هريرة رضي الله عنه: أن رجلاً قال للنبي صلى الله عليه وسلم: أوصني، قال: لا تغضب فردد مراراً، قال: لا تغضب"]
let i=0
let hd=document.querySelector("#hd")
function Hadith()
{
    if(i<h.length)
      {
         hd.innerHTML=h[i];
        i++;
      }
      else
         {
            i=0
         }
      }
let arr=["photo_13_2025-08-11_09-00-10.jpg","photo_12_2025-08-11_09-00-10.jpg","photo_11_2025-08-11_09-00-10.jpg","photo_10_2025-08-11_09-00-10.jpg","photo_9_2025-08-11_09-00-10.jpg","photo_8_2025-08-11_09-00-10.jpg","photo_7_2025-08-11_09-00-10.jpg","photo_6_2025-08-11_09-00-10.jpg","photo_5_2025-08-11_09-00-10.jpg"]
let as=document.querySelector("#as")
let n=0
function img()
{
  if(n<arr.length)
   {
      as.innerHTML=`<img class="gg" src=${arr[n]} >`
      n++
   }
   else
   {
      n=0;
   }
}

let Imgggg=document.querySelector("#Imgggg")
let num=0
 window.setInterval(function ds(){
   if(num<arr.length)
    {
       Imgggg.innerHTML=`<br><img src="${arr[num]}" id ="Img"><br><br><br><p id="p2"><i>${h[num]}</i></p><br>`
       num++
    }
    else
    {
       num=0;
    }
},2500)
